let data = [
    {
        "content": "愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光。就令萤火一般，也可以在黑暗里发一点光，不必等候炬火。此后如竟没有炬火，我便是唯一的光",
        "author": "鲁迅"
    },
    {
        "content": "每当我遇到自己不敢直视的困难时，我就会闭上双眼，想象自己是一个80岁的老人，为人生中曾放弃和逃避过的无数困难而懊悔不已，我会对自己说，能再年轻一次该有多好，然后我睁开眼睛：砰！我又年轻一次了！",
        "author": "说唱歌手Hopsin"
    },
    {
        "content": [
            "我的法官同事们，",
            "你们都是资深的法学专家，",
            "我想请大家一起考虑这个问题。",
            "法律是什么？",
            "法律的作用又是什么？",
            "经过了长达两年，",
            "817次漫长的庭审，",
            "我们终于认定了他们有罪。",
            "可是我们",
            "却一直在讨论文明和宗教。",
            "先生们，",
            "这不是大学的课堂，",
            "这也不是寺庙，",
            "这是法律的殿堂，",
            "我们需要讨论的，",
            "是怎么惩罚这些罪犯。",
            "我认为，",
            "宗教是告诉世人，",
            "怎样做才能达到天堂。",
            "而另一方面，",
            "法律明确规定了，",
            "什么事情我们不能做，",
            "否则就要受惩罚，",
            "就要上断头台，",
            "就要上绞刑架。",
            "这就是法律，",
            "这也是我一直坚持对战犯们，",
            "使用死刑的原因。",
            "他们除了掠夺别国的资源，",
            "扩张自己的领土，",
            "日本还杀害了无数无辜的平民。",
            "日本军队，",
            "抢劫 强奸 放火 杀戮。",
            "杀害了无数中国 菲律宾，",
            "英国 美国及其其他国家人们的生命。",
            "这还不足以被判处死刑吗？",
            "如果法律不给日本、",
            "不给这些战犯们最严厉的惩罚。",
            "谁敢保证日本，",
            "有一天不会再次挑起战争。",
            "谁能保证日本，",
            "不会再侵略别的国家。",
            "谁敢保证日本军国主义的幽灵，",
            "不会再次复活。",
            "在座哪位先生敢做出这样的保证？"
        ],
        "author": "《东京审判》梅汝璈"
    },
    {
        "content": [
            "美国要求你们立刻注意我们在这份传单上所说的话。",
            "我们已掌握人类从未有过的破坏力最大的爆炸物。一颗我们新近发明的原子弹的爆炸力实际上等于两千架我们的巨型B29轰炸机执行一次任务时所携带的爆炸力。这个可怕的事实是值得你们思考的。我们庄严地向你们保证，投弹是极其准确的。",
            "我们在你们的本土使用这种炸弹还刚刚开始。如果你们还有什么怀疑，请你们了解一下，广岛只不过挨了一颗原子弹后的情况。",
            "在利用这种炸弹摧毁军方拖延这场毫无用处的战争的一切资源之前，我们要求你们现在就向天皇请愿，结束战争。",
            "我们总统已为你们概述了体面的投降的十三条结果。我们敦促你们赶快接受这十三条，开始为建设一个更好的爱好和平的新日本而努力。",
            "你们现在就需要采取步骤，停止军事抵抗。否则，我们将坚决使用这种炸弹以及其他一切优越武器，立刻强行结束战争。",
            "现在就从你们的城市疏散开！"
        ],
        "author": "告日本人民书"
    },
    {
        "content": [
            "三年以来，在人民解放战争和人民革命中牺牲的人民英雄们永垂不朽！",
            "三十年以来，在人民解放战争和人民革命中牺牲的人民英雄们永垂不朽！",
            "由此上溯到一千八百四十年，从那时起，为了反对内外敌人，争取民族独立和人民自由幸福，在历次斗争中牺牲的人民英雄们永垂不朽！"
        ],
        "author": "人民英雄纪念碑碑文"
    },
    {
        "content": "嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子安贫，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭",
        "author": "《滕王阁序》王勃"
    },
    {
        "content": "我，白景琦，生于光绪六年，自幼顽劣，不服管教，闹私塾，打兄弟，毁老师，无恶不作。长大成人更肆无忌惮，与私家女私定终身，杀德国兵，交日本朋友，终被慈母大人赶出家门，从此闯荡江湖，独创家业。一泡屎骗了两千银子，收了沿河二十八坊，独创泷胶、保生、九宝、七秀三十二张秘方，济世救民，兴家旺族。为九红，我坐过督军的大牢；为槐花，坐过民国的监狱；为香秀，得罪过全家老少。越不叫我干什么，我偏要干什么！除了我妈，我没向谁低过头，没向谁弯过腰！如今，日本鬼子打到了咱们家门口，逼死了三老太爷，我立誓，宁死不当亡国奴！我死以后，本族老少如有与日本鬼子通同一气者，人人可骂之！我死以后，如有与日本鬼子通同一气者，人人可诛之！我死以后，如有与日本鬼子通同一气者：照着我这口刀说话！立遗嘱人，白景琦！",
        "author": "《大宅门》白景琦"
    },
    {
        "content": "有缺点的战士终竟是战士，完美的苍蝇也终究不过是苍蝇。",
        "author": "鲁迅"
    },
    {
        "content": [
            "面对滚滚而来的浊流",
            "如果你不能总是抗争，你是否可以选择偶尔抗争；",
            "如果你不敢积极的抗争，你还可以选择消极地抗争；",
            "如果你不能勇敢地表达，你可以选择含蓄地表达；",
            "如果你也不敢含蓄地表达，你可以选择沉默。",
            "如果你没有选择沉默而是选择了配合，但你还可以把调门放低一些。在你主动的或被迫地干着坏事时，能不能内心里还残留一点不安和负罪感。这一点儿不安或负罪感，仍是人性未泯的标记。",
            "即使你不去抗争，但对其他抗争者，要怀着几分敬重，即使没有这份敬重，也不要在背后放冷箭，使绊子，助纣为虐。",
            "我希望，你们在大潮袭来时，选择站在理性一边，文明一边，选择站在人民一边。"
        ],
        "author": "丛日云毕业典礼演讲"
    },
    {
        "content": [
            "你的父亲，还有很多的叔叔和伯伯，他们用鲜血和钢铁，披荆斩棘，为混乱的世界重新铸造了秩序，带来和平，化剑为犁，为蛮荒带来文明，用繁华取代贫瘠。铁血、牺牲和自我奉献，是我们这代人的天生使命，那些英雄和英雄的故事，在你们的年代将会成为传奇。",
            "现在，作为父辈的我们，已经完成了我们的使命。我们渐渐老去，而你们将成长，这是造化的规律，无可避免。将来的世界，是属于你们的。你们不必像我们一样，日夜不停的战斗，在刀光剑影中前行，父亲高大的脊背，已为你建起了遮挡风雨的屋顶。",
            "孩子，你将会过着和平、安详、无忧无虑的生活，你将注定是锦衣玉食，优于常人，这也注定了，缺乏磨砺的你，不可能像你父亲一样出色、一样优秀，一样勇敢、坚定和无畏。",
            "那又怎样呢？",
            "童年时，我们讲英雄故事给你听，并不是一定要你成为英雄，而是希望你具有高尚的品德。少年时，我们让你接触诗歌、绘画、音乐，是为了让你的心灵充满情趣。这些情趣会支撑你的一生。这样，即使在最严酷的冬天，你也不会忘记玫瑰的芳香。",
            "英雄辈出的民族是不幸的民族，和平的生活注定是平庸而繁琐的。有些事，或许你现在还无法理解。但当你长大，你就会明白：你的父亲，一定不会希望你成为英雄，世俗的很多东西，耀眼而毫无价值。只要你能健康的成长，正直的做人，独立的思考，幸福的生活，这是父辈对你的最高期望。"
        ],
        "author": "小说《紫川》"
    },
    {
        "content": [
            "如果周围的人毫无理性地向你发难，你仍能镇定自若保持冷静；",
            "如果众人对你心存猜忌，你仍能自信如常并认为他们的猜忌情有可原；",
            "如果你肯耐心等待不急不躁，",
            "或遭人诽谤却不以牙还牙，",
            "或遭人憎恨却不以恶报恶；",
            "既不装腔作势，亦不气盛趾高；",
            "如果你有梦想，而又不为梦主宰；",
            "如果你有神思，而又不走火入魔；",
            "如果你坦然面对胜利和灾难，对虚渺的胜负荣辱胸怀旷荡；",
            "如果你能忍受有这样的无赖，歪曲你的口吐真言蒙骗笨汉，",
            "或看着心血铸就的事业崩溃，仍能忍辱负重脚踏实地重新攀登；",
            "如果你敢把取得的一切胜利，为了更崇高的目标孤注一掷，",
            "面临失去，决心从头再来而绝口不提自己的损失；",
            "如果人们早已离你而去，你仍能坚守阵地奋力前驱，",
            "身上已一无所有，唯存意志在高喊“顶住”；",
            "如果你跟平民交谈而不变谦虚之态，",
            "亦或与王侯散步而不露谄媚之颜；",
            "如果敌友都无法对你造成伤害；",
            "如果众人对你信赖有加却不过分依赖；",
            "如果你能惜时如金利用每一分钟不可追回的光阴；",
            "那么，你的修为就会如天地般博大，并拥有了属于自己的世界，",
            "更重要的是：孩子，你成为了真正顶天立地之人！"
        ],
        "author": "《如果》拉迪亚德·吉卜林"
    },
    {
        "content": "当我真正开始爱自己，我才认识到，所有的痛苦和情感的折磨，都只是在警告我：我的生活违背了自己的本心。",
        "author": "查理·卓别林"
    },
    {
        "content": "我们必须全力以赴，同时又不抱持任何希望。不管做什么事，都要当它是全世界最重要的一件事，但同时又知道这件事根本无关紧要。",
        "author": "赖内·马利亚·里尔克"
    },
    {
        "content": "世上只有一种真正地英雄主义，那就是认清生活的真相后依然热爱生活。",
        "author": "罗曼·罗兰"
    },
    {
        "content": [
            "健康所系，性命相托。",
            "当我步入神圣医学学府的时刻，谨庄严宣誓：",
            "我志愿献身医学，热爱祖国，忠于人民，恪守医德，尊师守纪，刻苦钻研，孜孜不倦，精益求精，全面发展。",
            "我决心竭尽全力除人类之病痛，助健康之完美，维护医术的圣洁和荣誉，救死扶伤，不辞艰辛，执着追求，为祖国医药卫生事业的发展和人类身心健康奋斗终生。"
        ],
        "author": "医学生誓言"
    },
    {
        "content": "这些年我一直在提醒自己一件事，千万不要自己感动自己，大部分人看似的努力，不过是愚笨导致的，什么熬夜工作到天亮，连续几天睡几个小时，好久没有休息了，如果这些东西也值得夸耀，那么富土康上任何一个人都比你努力多了！人难免有自怜的情绪，唯有时刻保持清醒，才能够看清真正的价值在哪里。",
        "author": "于宙"
    },
    {
        "content": [
            "所有获得巨大财富的人，他的财富积累都是阶越式的，不可能是线性增长出来的。",
            "所以绝大数的屌丝无法完成逆袭，而只能在逆袭的口号声中麻醉度日,",
            "如果你要完成逆袭，就得（很大程度上）依靠偶然性，你得去寻找运气，而不是让运气找你。"
        ],
        "author": "冯仑"
    },
    {
        "content": "长夜将至，我从今开始守望，至死方休。我将不娶妻、不封地、不生子。我将不戴宝冠，不争荣宠。我将尽忠职守，生死於斯。我是黑暗中的利剑，长城上的守卫。我是抵御寒冷的烈焰，破晓时分的光线，唤醒眠者的号角，守护王国的坚盾。我将生命与荣耀献给守夜人，今夜如此，夜夜皆然。",
        "author": "守夜人誓言"
    },
    {
        "content": "如果你正在地狱中前行，那就坚持走下去",
        "author": "温斯顿·丘吉尔"
    },
    {
        "content": [
            "我曾七次鄙视自己的灵魂： ",
            "第一次，当它本可进取时，却故作谦卑",
            "第二次，当它在空虚时，用爱欲来填充",
            "第三次，在困难和容易之间，它选择了容易",
            "第四次，它犯了错，却借由别人也会犯错来宽慰自己",
            "第五次，它自由软弱，却把它认为是生命的坚韧",
            "第六次，当它鄙夷一张丑恶的嘴脸时，却不知那正是自己面具中的一副",
            "第七次，它侧身于生活的污泥中，虽不甘心，却又畏首畏尾"
        ],
        "author": "卡里·纪伯伦"
    },
    {
        "content": "车到山前必有路，船到桥头自然直",
        "author": "俗语"
    },
    {
        "content": "一个人的一生应该是这样度过的：当他回首往事的时候，他不会因为虚度年华而悔恨，也不会因为碌碌无为而羞耻；这样，在临死的时候，他就能够说：“我的整个生命和全部精力，都已经献给世界上最壮丽的事业——为人类的解放而斗争",
        "author": "保尔·柯察金"
    },
    {
        "content": "人家打你，你不要倒！人家赶你，你不要走！人家整你，你不要死！",
        "author": "周恩来"
    },
    {
        "content": [
            "独坐池塘如虎踞，",
            "绿荫树下养精神。",
            "春来我不先开口，",
            "哪个虫儿敢作声。"
        ],
        "author": "毛泽东"
    },
    {
        "content": [
            "卑鄙是卑鄙者的通行证，",
            "高尚是高尚者的墓志铭，",
            "看吧，在那镀金的天空中，",
            "飘满了死者弯曲的倒影。",
            "冰川纪过去了，",
            "为什么到处都是冰凌？",
            "好望角发现了，",
            "为什么死海里千帆相竞？",
            "我来到这个世界上，",
            "只带着纸、绳索和身影，",
            "为了在审判前，",
            "宣读那些被判决的声音。",
            "告诉你吧，世界",
            "我——不——相——信！",
            "纵使你脚下有一千名挑战者，",
            "那就把我算作第一千零一名。",
            "我不相信天是蓝的，",
            "我不相信雷的回声，",
            "我不相信梦是假的，",
            "我不相信死无报应。",
            "如果海洋注定要决堤，",
            "就让所有的苦水都注入我心中，",
            "如果陆地注定要上升，",
            "就让人类重新选择生存的峰顶。",
            "新的转机和闪闪星斗，",
            "正在缀满没有遮拦的天空。",
            "那是五千年的象形文字，",
            "那是未来人们凝视的眼睛。"
        ],
        "author": "北岛《回答》"
    },
    {
        "content": "苟利国家生死以，岂因祸福趋避之。",
        "author": "林则徐"
    },
    {
        "content": [
            "要保持赤子之心很难，怎么能够一辈子保持赤子之心？这是人生最大的难题。在这方面我想谈谈我个人的经验。",
            "人生道路绝对是坎坷的，会遇到很多外在的黑暗，更可怕的是这些外在的黑暗都会转化为内在的黑暗、内心的黑暗。外在压力大了以后，你就会觉得绝望，觉得人生无意义，这就是内在的黑暗。所以你要不断面对并战胜这两方面的黑暗，就必须唤醒你内心的光明。",
            "我为什么前面强调打好底子？如果你在大学期间没有打好光明的底子，当你遇到外在黑暗和内在黑暗的时候，你心里的光明唤不出来，那你就会被黑暗压跨。",
            "我每当遇到外在压力的时候，总是为自己设计一些富有创造性的工作，全身心地投入进去，在这一过程中抵御外在和内在的黑暗。压力越大，书读得越多，写东西越多，我每一次的精神危机都是这样度过的。"
        ],
        "author": "钱理群《二十六篇：和青年朋友谈心》"
    },
    {
        "content": [
            "我不相信 天是蓝的",
            "我不相信 雷没有回声",
            "我不相信 梦是假的",
            "我不相信 死无报应",
            "我不想安慰你",
            "在颤抖的枫叶上 写满关于春天的谎言",
            "来自热带的太阳鸟 并没有落在我们的树上",
            "而背后的森林之火 不过是尘土飞扬的黄昏",
            "但我相信 你的眼睛",
            "但我相信 滚烫的泪",
            "我永远相信 你的叮咛",
            "我永远相信 这个夜晚",
            "即使明天早上 枪口和血淋淋的太阳",
            "让我交出自由 青春和我的笔",
            "我也绝不交出这个夜晚 绝不交出你",
            "让墙壁堵住我的嘴唇",
            "让铁条分割我的天空",
            "只要有心的跳动 就有血的潮汐",
            "而你的微笑 将每夜升起",
            "在我的小窗前 唤醒记忆"
        ],
        "author": "北岛《我不相信》"
    },
    {
        "content": "人初做事，如鸡伏卵，不舍而生气渐充。如燕营巢，不息而结构渐牢。如滋培之木，不见其长，有时而大。如有本之泉，不舍昼夜，盈科而后进，放乎四海",
        "author": "曾国藩"
    },
    {
        "content": "先干起来，逢山开路，遇水搭桥，有什么问题解决什么问题",
        "author": "匿名"
    },
    {
        "content": "兴趣是最好的老师，其次是耻辱",
        "author": "匿名"
    },
    {
        "content": "你要克服的是你的虚荣心，是你的炫耀欲，你要对付的是你时刻想要出风头的小聪明",
        "author": "毛姆"
    },
    {
        "content": [
            "因为害怕自己并非明珠而不敢刻苦琢磨，又因为有几分相信自己是明珠，而不能与瓦砾碌碌为伍，遂逐渐远离世间，疏避人群，结果在内心不断地用愤懑和羞怒饲育着自己懦弱的自尊心。世上每个人都是驯兽师，而那匹猛兽，就是每人各自的性情。对我而言，猛兽就是这自大的羞耻心了。老虎正是它。我折损自己，施苦妻儿，伤害朋友。末了，我就变成了这副与内心一致的模样",
            "如今想起来，我真是空费了自己那一点仅有的才能，徒然在口头上卖弄着什么“人生一事不为则太长，欲为一事则太短”的警句，可事实是，唯恐暴露才华不足的卑怯的畏惧，和厌恶钻研刻苦的惰怠，就是我的全部了。但远比我缺乏才华，可由于专念磨砺而成就堂堂诗家的，也颇不乏其人。成为老虎后的今天，我才总算看到了这一点。"
        ],
        "author": "中岛敦《山月记》"
    },
    {
        "content": "当你厌恶你身边的人，你表达厌恶最好的方式不是和他们争吵，而是自己勤快点儿，加把劲离开他们。那样，他们就永远从你的生活中消失，和死了差不多",
        "author": "于宙"
    },
    {
        "content": [
            "温柔是种居高临下的东西。",
            "因为要面对的人或事只会越来越强",
            "只有不断往前看，变强大些，",
            "才能给得起温柔。",
            "成熟就是越来越能接受现实，而不是越来越现实。如果越来越冷漠，不要以为成长了，其实没有。",
            "成熟应该是变温柔，对全世界都温柔。",
            "变得强大原来从来不是为了能够肆意妄为，而是为了能够一笑泯恩仇，在拥有选择权的情况下选择对所有人温柔。"
        ],
        "author": "有本事你来咩我呀"
    },
    {
        "content": "现在有一个很大的误区就是，办公室的白领们自以为自己的表现优于父母。其实这不过是因为经济结构转型造成的误会而已。现在在公司的格子间里面哼哧哼哧做PPT的那些人，和当年踩着缝纫机的女工们，其实没有本质区别。 同理，父母当年在菜市场讨价还价一分两分和现在抢红包很起劲的差不多；父母当年非要给遥控器套个塑料袋跟现在手机非得戴个套也差不多；现在每天刷微博刷朋友圈的人，跟当年蹲墙根晒太阳磕瓜子的也没什么区别......",
        "author": "秦桑"
    },
    {
        "content": "你与别人花费一样的时间，因为别人用心，而你吊儿郎当，所以到了最后检验成果的时候，别人成功，而你除了赔了时间之后，一无所得。",
        "author": "飞行员舒克"
    },
    {
        "content": [
            "木秀于林，风必摧之。如果身边都是木，就是不一样的风景。",
            "鹤立鸡群，倍受排挤。你可以选择离开鸡群。",
            "人生最浪费生命的就是在没有选择时，进入某一个团体一段时间，却非逼着自己浪费时间做些蠢事去合群。",
            "道不同不相为谋，人贵在有自知之明。"
        ],
        "author": "万彦文"
    },
    {
        "content": "没有捷径，逼迫自己！推掉不必要的社交，戒掉浪费时间的爱好，让自己感受到孤独和清醒，一把枪指着头，三个月内必须达到预想的目标，一件事，一件可以让自己更上一个台阶的事，会比无数看似有趣的生活妙招更让你喜欢自己！",
        "author": "Z先生"
    },
    {
        "content": [
            "这世上，本就没有任何一句话，可以让你醍醐灌顶。",
            "真正叫你醍醐灌顶的，只能是一段经历。而那句话，只是火药仓库内划燃的一根火柴"
        ],
        "author": "匿名"
    },
    {
        "content": [
            "别光迷恋爱情，人品比这更重要。爱情是暂时的，人品是永恒的。",
            "当爱情慢慢淡去，两个人的关系是靠善良来维系。",
            "好好看看他如何对待身边的人，或许那就是你将来的生活状态。"
        ],
        "author": "苏岑"
    },
    {
        "content": "必然的王国必然地过去了，自由的王国自由得不肯来，现在是什么王国呢？这个查之有头，望不见尾的“现在”",
        "author": "木心《真的》"
    },
    {
        "content": "我如果爱你，绝不像攀援的凌霄花，借你的高枝炫耀自己：我如果爱你，绝不学痴情的鸟儿，为绿荫重复单调的歌曲；也不止像泉源，常年送来清凉的慰籍；也不止像险峰，增加你的高度，衬托你的威仪。甚至日光。甚至春雨。不，这些都还不够！我必须是你近旁的一株木棉，做为树的形象和你站在一起。",
        "author": "亦舒《致橡树》"
    },
    {
        "content": "一对年老夫妇，一起走过大半辈子，多年来他们每晚睡前最后一刻必定会跟对方说一句：我爱你。别人问他们为什么有这个习惯，丈夫说：我们都这把年纪了，这样做是为了保证，假如我们其中一个第二天没有醒来，我们在人生里留给对方最后一句说话就是这三个字。",
        "author": "匿名"
    },
    {
        "content": "从前的艺术家的风格，都是徐徐徐徐形成的，自然发育，有点受日月之精华的样子。地球大，人口少，光阴慢，物质和精神整个儿松松宽宽潇潇洒洒，所以：人格即风格。",
        "author": "木心"
    },
    {
        "content": "真正的个人主义在于把你自己这块材料铸造成个东西。有时候，我觉得这个世界就好像大海上翻了船，最要紧的是救出我自己。救国需从救出你自己开始。",
        "author": "胡适"
    },
    {
        "content": "如果你不能应付我最差的一面，那么你也不值得拥有我最好的一面。",
        "author": "玛丽莲·梦露"
    },
    {
        "content": "如果忘了，就不重要。",
        "author": "张大春"
    },
    {
        "content": "如果你是一个作家，你为权力写作，你就是为腐败服务，为愚蠢服务，为折腾服务，为残忍服务。如果你是被迫的，还情有可原；如果你是自觉的，那你真能逃脱帮凶之责、贩毒之嫌？",
        "author": "沙叶新"
    },
    {
        "content": [
            "从来都只有好聚，哪有好散？",
            "最终喜欢变成了不甘，深爱变成了心酸，思念变成了心烦，主动变成了犯贱。"
        ],
        "author": "匿名"
    },
    {
        "content": "读书的目的，不在于取得多大的成就，而在于，当你被生活打回原形，陷入泥潭时，给你一种内在的力量",
        "author": "梁晓声"
    },
    {
        "content": "人脉不是能够帮到你的人，而是你能够帮到的人",
        "author": "匿名"
    },
    {
        "content": "一个知识越贫乏的人，越是拥有一种莫名奇怪的勇气和一种莫名奇怪的自豪感。因为知识越贫乏，你所相信的东西就越绝对，因为你根本没有听过与此相对立的观点。夜郎自大是无知者，和好辩者的天性。",
        "author": "罗翔"
    },
    {
        "content": "大部分的生活都乏味得不值一提，哪个年龄段都乏味。换另一种牌子的香烟也好，搬到一个新地方去住也好，订阅别的报纸也好，坠入爱河又脱身也好，我们一直在以或轻浮或深沉的方式，对抗日常生活那无法稀释的乏味。",
        "author": "杜鲁门·卡波特"
    },
    {
        "content": "我们终此一生都得迎接最后的大限之日，无法回头。因此当下根本无需介意年龄，只要努力，任性地活着就好，生命的滋味就在于此",
        "author": "森山大道"
    },
    {
        "content": "我希望你们可以尽己所能，想方设法给自己挣到足够的钱，好去旅游，去无所事事，去思索世界的未来或过去，去看书，做梦，或是在街头闲逛，让思考的鱼线深深沉入这条溪流中去。",
        "author": "弗吉尼亚·伍尔夫"
    },
    {
        "content": "人类之所以有进步，主要原因是下一代不怎么听上一代的话",
        "author": "倪匡"
    },
    {
        "content": [
            "华生问福尔摩斯，为什么咱俩老形影不离，可每次都是你先弄明白案件真相？",
            "福尔摩斯说，因为我总在观察。",
            "华生说我也观察啊。",
            "福尔摩斯说，那好，门外那楼梯你也天天走吧？一共多少级？",
            "华生说不知道。",
            "福尔摩斯说，是17级，你只是看见，我这才叫观察。"
        ],
        "author": "《福尔摩斯》"
    },
    {
        "content": "我们很少信任比我们好的人，宁肯避免与他们来往。相反，我们常对与我们相似、和我们有着共同弱点的人吐露心迹。我们并不希望改掉弱点，只希望受到怜悯与鼓励。",
        "author": "加缪"
    },
    {
        "content": "一个人愈没有值得自夸之处，就愈容易夸耀自己的国家、宗教、种族或他所参与的神圣事业。这本质上是对一种事物牢牢攀附，攀附一件可以带给我们渺小人生意义和价值的东西。",
        "author": "埃里克•霍弗"
    },
    {
        "content": "人生并不像一年四季那样分明，40岁的相扑选手就算老，但50多岁的政客还会被称之为菜鸟，很难确切区分多少岁算是老人，我们必须自己决定自己老了没有",
        "author": "北野武"
    },
    {
        "content": "一个人成熟的标志之一，就是明白每天发生在自己身上99%的事情，于别人而言根本毫无意义",
        "author": "马克·鲍尔莱因"
    },
    {
        "content": "人不就是这样吗，安慰别人的时候头头是道，自己遇上点过不去的坎立马无法自拔。道理都懂，只是情绪作祟，故事太撩人",
        "author": "木心"
    },
    {
        "content": "她那时候还太年轻，不知道所有命运赠送的礼物，早已在暗中标好了价格",
        "author": "茨威格"
    },
    {
        "content": "不论你信不信，极大的概率，你这一辈子就是一个普通人。最最普通的人，一辈子发不了财，赚不了多少钱，如果没有家里支持，你要当至少十几年房奴，才能在立足的城市里有一套属于自己的房子。",
        "author": "匿名"
    },
    {
        "content": [
            "我挺厌恶有一种人，不明白任何情况，就劝你一定要大度的人。这种人你要离他远一点，因为雷劈他的时候会连累到你！",
            "啊，扎你一刀，你这血还没擦干净呢，他在那，“哎，你要勇敢起来。” 因为人都是这样，事不关己高高挂起，劝别人的时候那说得好听，但并不解决问题，所以你心里明白自己该做什么就好。"
        ],
        "author": "郭德纲"
    },
    {
        "content": "要得到你想要的某样东西，最可靠的办法是让你自己配得上它。这是一个十分简单的道理，是黄金法则",
        "author": "查理·芒格"
    },
    {
        "content": "一个简单的方法，让你身价增加50%，那就是磨练你的书面和口头的沟通技巧 。如果你无法沟通，就像在黑暗中对一个女孩抛媚眼，那是没用的， 你可以拥有世界上所有的能力，但你必须能够表达出来",
        "author": "巴菲特"
    },
    {
        "content": "切忌交浅言深",
        "author": "匿名"
    },
    {
        "content": "我以为别人尊重我，是因为我很优秀。慢慢的我明白了，别人尊重我，是因为别人很优秀，优秀的人，更懂得尊重别人，对人恭敬其实是在庄严你自己。",
        "author": "仓央嘉措"
    },
    {
        "content": "不管你活成什么样，不管你多优秀，多完美，总有人喜欢你，总有人不喜欢你",
        "author": "陈果"
    },
    {
        "content": "多读几本好书、多交几个朋友、甚至是养成几个好习惯。二十岁时投资和储蓄的时候，要养足未来的资本",
        "author": "杨澜"
    },
    {
        "content": "不要让你的脾气大过本事，如果你是对的，你没必要发脾气；如果你是错的，你没资格发脾气",
        "author": "匿名"
    },
    {
        "content": "走在人生的某个阶段，我决心要成为一个富有的人，这不是因为爱钱的缘故，而是为了追求那种独立自主的感觉。我喜欢能够自由地说出自己的想法，而不是受他人意志左右",
        "author": "查理·芒格《投资圣经》"
    },
    {
        "content": "读书可以经历一千种人生，不读书的人只能活一次",
        "author": "匿名"
    },
    {
        "content": "处理好与人的关系，就三句话：看人长处、帮人难处、记人好处",
        "author": "匿名"
    },
    {
        "content": "不随便评价他人，是一种修养。而不活在别人的评价里，是一种修行",
        "author": "匿名"
    },
    {
        "content": [
            "是的，",
            "只要不丧失远大的使命感，",
            "或者说还保持着较为清醒的头脑，",
            "就决然不能把人生之船，长期停泊在某个温暖的港湾。",
            "应该重新扬起风帆，驶向生活的惊涛骇浪中，以领略其间的无限风光。",
            "人，不仅要战胜失败，而且还要超越胜利。"
        ],
        "author": "路遥"
    },
    {
        "content": "学习只有两种途径：一个是阅读，另一个是与更聪明的人为伍",
        "author": "威尔·罗杰"
    },
    {
        "content": [
            "人就是这样，不是说成绩有多么重要，但是优秀是一种习惯，懒惰是一种惯性。",
            "人和人的差别又是就是因为每天积累差了一点点，终于有天你发现，原来我和他差了这么多。",
            "如果离成功只有一步之遥，那谁都会咬牙坚持下来，如果发现距离很远，那谁都会放弃。",
            "而关键的一咬牙，上了一个层次，有人就会春风得意，越活越成功，有人没上去，永远在苦逼中挣扎求生存。",
            "然后想，原来在当时，我们俩的距离是那么近。"
        ],
        "author": "匿名"
    },
    {
        "content": "一个忠告是，不要用朋友圈的图文来衡量经济水准，不要靠微博上的讨论来修正三观，不要用知乎上的问答来指导感情。三者都是高屋建瓴，看久了全空空荡荡",
        "author": "倪一宁"
    },
    {
        "content": "没有自我的人自我感觉都特别良好",
        "author": "木心"
    },
    {
        "content": "一定养成归纳总结的习惯，这是我们生活工作中超越普通人最快的法门",
        "author": "匿名"
    },
    {
        "content": "首先我们要学会游戏规则，然后我们要比其他人玩得更好",
        "author": "爱因斯坦"
    },
    {
        "content": "人可以自私，但是不可以自私到以为别人就不自私",
        "author": "冰临神下"
    },
    {
        "content": "掌握权力技巧并不会让你更孤独，相反，会让你和别人（包括家人）之间的关系更融洽",
        "author": "程墨"
    },
    {
        "content": "如果你的文明是叫我们卑躬屈膝，那我就带你们看看野蛮的骄傲",
        "author": "《赛德克巴莱》"
    },
    {
        "content": "你必须只有内心丰富，才能摆脱这些生活表面的相似",
        "author": "王朔"
    },
    {
        "content": ["吸引一个人的最好方式", "是独立自主 而非刻意谄媚"],
        "author": "《艺妓回忆录》"
    },
    {
        "content": "物质愈丰裕，我想要的却愈少。许多人想登上月球，我却想多看看树。",
        "author": "奥黛丽.赫本"
    },
    {
        "content": "对一个人的冲动大概在15天左右，如果过了这个时间段还没有追到，那那份冲动就会减少甚至消失，对一个人的回忆大概在120天左右，如果过了这个时间段还是对那个人念念不忘，那么这个是你深爱过的人",
        "author": "匿名"
    },
    {
        "content": "那一天我二十一岁，在我一生的黄金时代。我有好多奢望。我想爱，我想吃，我还想一瞬间变成天上半明半暗的云",
        "author": "王小波"
    },
    {
        "content": [
            "林语堂讲社会十大俗气：",
            "一、腰有十文钱必振衣作响。",
            "二、每与人言必谈及贵戚。",
            "三、遇美人必急索登床。",
            "四、见到问路之人必作傲睨之态。",
            "五、与朋友相聚便喋喋高吟其酸腐诗文。",
            "六、头已花白却喜唱艳曲。",
            "七、施人一小惠便广布于众。",
            "八、与人交谈便借刁言以逞才。",
            "九、借人之债时其脸如丐，被人索偿时则其态如王。",
            "十、见人常多蜜语而背地却常揭人短处。"
        ],
        "author": "林语堂"
    },
    {
        "content": "笑，全世界便与你同笑。哭，你便独自哭",
        "author": "张爱玲"
    },
    {
        "content": "多年不见的老朋友，一旦相见，因为都是极熟而又极生疏的人，说话好像深了不是，浅了又不是，彼此还都在暗中摸索，是一种异样的心情，然而也不减它的愉快",
        "author": "张爱玲"
    },
    {
        "content": [
            "螃蟹在剥我的壳，笔记本在写我",
            "满天的我落在枫叶上雪花上",
            "而你在想我"
        ],
        "author": "小雨"
    },
    {
        "content": "你再不来，我要下雪了",
        "author": "木心"
    },
    {
        "content": "我是宋清如至上主义者",
        "author": "朱生豪"
    },
    {
        "content": "曾经心中执剑的少年，此刻也混迹于市井之间",
        "author": "朱炫"
    },
    {
        "content": "如果问我思念多重，不重的，像一座秋山的落叶",
        "author": "简媜"
    },
    {
        "content": "虽然辛苦，我还是会选择那种滚烫的人生",
        "author": "北野武"
    },
    {
        "content": "人生建议：不要陪一个男孩子长大 ",
        "author": "匿名"
    },
    {
        "content": "你问人问题，她若答非所问，便已是答了，毋需再问",
        "author": "木心"
    },
    {
        "content": "疼自己的人都不在了，娇气给谁看呢",
        "author": "匿名"
    },
    {
        "content": [
            "我愿意抖落浑身的尘埃",
            "我愿意拔除斑斓的羽衣",
            "我愿意抚平残余的梦痕",
            "我愿意驱逐沉重的灵魂",
            "没有叶没有根没有花朵",
            "没有爱没有恨没有追求",
            "能像轻烟一样无拘无束？",
            "能像清风一样自由自在？"
        ],
        "author": "宋清如"
    },
    {
        "content": [
            "这里一切都是丑的，风、雨、太阳，都丑，人也丑，我也丑得很。只有你是青天一样可羡。",
            "想把你抱起来高高的丢到天上去。醒来觉得甚是爱你。",
            "不要愁老之将至，你老了一定很可爱。而且，假如你老了十岁，我当然也同样老了十岁，世界也老了十岁，上帝也老了十岁，一切都是一样。",
            "我想要在茅亭里看雨，假山石边看蚂蚁，看蝴蝶恋爱，看蜘蛛结网，看水，看船，看云，看瀑布，看宋清如甜甜地睡觉"
        ],
        "author": "朱生豪（写给宋清如的情诗）"
    },
    {
        "content": "布衣饭菜，可乐终身",
        "author": "浮生六记"
    },
    {
        "content": [
            "我生来就是高山而非溪流，我欲于群峰之巅俯视平庸的沟壑",
            "我生来就是人杰而非草芥，我站在伟人之肩藐视卑微的懦夫"
        ],
        "author": "张桂梅"
    }
]

function fetchData() {
    const dataRandom = data[Math.floor(Math.random() * data.length)]
    return dataRandom;
}

function saveLocalData(dataRandom) {
    if (localStorage.content) {
        if (JSON.parse(localStorage.content).length >= data.length) {
            const filteData = data.filter(item => item.content !== dataRandom.content)
            let array = []
            array.push(filteData[0].content)
            localStorage.setItem("content", JSON.stringify(array));
            return filteData[0];
        }

        if (localStorage.content.indexOf(dataRandom.content) > -1) {
            let dataRandom = fetchData()
            return saveLocalData(dataRandom)
        } else {
            let array = JSON.parse(localStorage.content);
            array.push(dataRandom.content)
            localStorage.setItem("content", JSON.stringify(array));
            return dataRandom;
        }
    } else {
        let array = []
        array.push(dataRandom.content)
        localStorage.setItem("content", JSON.stringify(array));
        return dataRandom;
    }
}

function appendHtml(dataRandom) {
    if (typeof dataRandom.content !== 'string') {
        let content_array = ""
        dataRandom.content.forEach(item => {
            content_array += `<p class='mb-3 leading-8 text-base'>${item}</p>`
        })
        document.getElementById("content").innerHTML = content_array;
    } else {
        const textStyle = dataRandom.content.length < 40 ? 'text-lg leading-10' : 'text-base leading-8'
        document.getElementById("content").innerHTML = `<p class='mb-3 ${textStyle}'>${dataRandom.content}</p>`;
    }
    document.getElementById("author").innerHTML = "——" + dataRandom.author
}

function randomData() {
    const dataRandom = fetchData()
    let localData = saveLocalData(dataRandom)
    appendHtml(localData)
}


randomData()